'use strict';

// 客户相关枚举值
module.exports = {
  // 兴趣爱好
  hobby: [
    {
      class_name: '运动',
      params: {
        101: '瑜伽', 102: '舞蹈', 103: '徒步', 104: '篮球', 105: '足球',
        106: '乒乓球', 107: '台球', 108: '网球', 109: '排球', 110: '羽毛球',
        111: '跑步', 112: '游泳', 113: '滑雪', 114: '爬山', 115: '健身',
        116: '轮滑', 117: '高尔夫球',
      },
    },
    {
      class_name: '旅行',
      params: {
        201: '国内游', 202: '境外游', 203: '自驾游', 204: '周边游',
        205: '沙发客', 206: '户外探险',
      },
    },
    {
      class_name: '艺术',
      params: {
        301: '绘画', 302: '书法', 303: '音乐', 304: '摄影', 305: '戏曲',
        306: '写作', 307: '阅读', 308: '魔术', 309: '科技',
      },
    },
    {
      class_name: '美食',
      params: {
        401: '烹饪', 402: '中餐', 403: '西餐', 404: '品茶', 405: '品酒',
        406: '咖啡', 407: '火锅',
      },
    },
    {
      class_name: '游戏',
      params: { 501: '网络游戏', 502: '手机游戏', 503: '棋牌', 504: '桌游' },
    },
    {
      class_name: '娱乐',
      params: {
        601: '聚会', 602: '追星', 603: '八卦', 604: '星座', 605: 'K歌',
        606: '表演', 607: '电影', 608: '连续剧', 609: '韩剧', 610: '美剧',
      },
    },
    {
      class_name: '休闲',
      params: {
        701: '钓鱼', 702: '花鸟', 703: '宠物', 704: '散步', 705: '睡懒觉',
        706: '网购', 707: '动漫',
      },
    },
    {
      class_name: '金融',
      params: {
        801: '股票', 802: '基金', 803: '债券', 804: '期货', 805: '投资',
      },
    },
    {
      class_name: '语言',
      params: { 901: '英语', 902: '日语', 903: '汉语', 904: '小语种' },
    },
    {
      class_name: '乐器',
      params: {
        1001: '吉他', 1002: '口琴', 1003: '钢琴', 1004: '风琴',
        1005: '小提琴', 1006: '铜管乐器', 1007: '打击乐器', 1008: '民族乐器',
        1009: '西洋乐器',
      },
    },
  ],

  // 职业
  occupation: [
    {
      class_name: '通用岗位',
      params: {
        101: '销售', 102: '市场', 103: '人力资源', 104: '行政', 105: '公关',
        106: '客服', 107: '采购', 108: '技工', 109: '公司职员', 110: '职业经理人',
        111: '私营企业主', 112: '中层管理者', 113: '自由职业者',
      },
    },
    {
      class_name: 'IT互联网',
      params: {
        201: '开发工程师', 202: '测试工程师', 203: '设计师', 204: '运营师',
        205: '产品经理', 206: '风控安全', 207: '个体/网店',
      },
    },
    {
      class_name: '文化传媒',
      params: {
        301: '编辑策划', 302: '记者', 303: '艺人', 304: '经纪人',
        305: '媒体工作者',
      },
    },
    {
      class_name: '金融',
      params: {
        401: '咨询', 402: '投行', 403: '保险', 404: '金融分析', 405: '财务',
        406: '风险管理', 407: '风险投资人',
      },
    },
    {
      class_name: '教育培训',
      params: {
        501: '学生', 502: '留学生', 503: '大学生', 504: '研究生', 505: '博士',
        506: '科研人员', 507: '教师',
      },
    },
    {
      class_name: '医疗生物',
      params: { 601: '医生', 602: '护士', 603: '宠物医生', 604: '医学研究' },
    },
    {
      class_name: '政府组织',
      params: {
        701: '公务员', 702: '事业单位', 703: '军人', 704: '律师', 705: '警察',
        706: '国企工作者', 707: '运动员',
      },
    },
    {
      class_name: '工业制造',
      params: {
        801: '技术研发', 802: '技工', 803: '质检', 804: '建筑工人', 805: '装修工人',
        806: '建筑设计师',
      },
    },
    {
      class_name: '餐饮出行',
      params: {
        901: '厨师', 902: '服务员', 903: '收银', 904: '导购', 905: '保安',
        906: '乘务人员', 907: '驾驶员', 908: '航空人员', 909: '空乘',
      },
    },
    {
      class_name: '服务业',
      params: {
        1001: '导游', 1002: '快递员（含外卖）', 1003: '美容美发', 1004: '家政服务',
        1005: '婚庆摄影', 1006: '运动健身',
      },
    },
    {
      class_name: '其它',
      params: { 1101: '其它' },
    },
  ],

  // 性别
  sex: { 1: '男', 2: '女' },

  // 家庭情况
  family_condition: { 1: '单身', 2: '两口子', 3: '三口之家', 4: '大家庭' },
  // 家庭收入
  family_earning: {
    1: '5万以下', 2: '5-10万', 3: '10-20万', 4: '20-30万', 5: '30-50万',
    6: '50-100万', 7: '100万以上',
  },
  // 学历
  eduction: {
    1: '小学', 2: '初中', 3: '高中', 4: '专科', 5: '本科', 6: '硕士', 7: '博士',
  },

  // 车相关常量
  // 购车目的
  car_use_to: { 1: '家用代步', 2: '商务用车', 3: '拉货', 4: '户外越野', 5: '玩车' },
  // 购车预算
  car_budget: {
    1: '不限', 2: '0-3万', 3: '3-5万', 4: '5-10万', 5: '10-20万', 6: '20-30万',
    7: '30-50万', 8: '50-80万', 9: '80万以上',
  },
  // 计划购车时间
  car_buy_time: {
    0: '暂不购车', 1: '1周内', 2: '1月内', 3: '半年内', 4: '1年内', 5: '1年以后',
  },
  // 出手时间
  resell_date_type: {
    1: '1周内', 2: '1月内', 3: '半年内', 4: '1年内', 5: '1年以后',
  },
  // 购车类型
  car_type: { 1: '新车', 2: '二手车' },
  // 车身颜色
  car_color: {
    1: '黑色', 2: '白色', 3: '银灰色', 4: '深灰色', 5: '红色', 6: '橙色',
    7: '绿色', 8: '蓝色', 9: '咖啡色', 10: '紫色', 11: '香槟色', 12: '多彩色',
    13: '黄色', 14: '其他',
  },
  // 内饰颜色类型
  car_inner_color: { 1: '浅', 2: '深' },
  // 购车关注点
  car_prefer_side: {
    1: '操控', 2: '舒适', 3: '空间', 4: '动力', 5: '油耗', 6: '配置', 7: '价格',
    8: '外观', 9: '安全', 10: '做工',
  },
  // 品牌偏好
  prefer_brand: {
    1: '不限', 2: '国产', 3: '德系', 4: '美系', 5: '法系', 6: '日系', 7: '韩系',
    8: '不要日系', 9: '不要韩系', 10: '不要国产', 11: '其它',
  },

  // 客户关系
  cust_relation: {
    1: '朋友', 2: '同学', 3: '同事', 4: '哥哥', 5: '嫂子', 6: '姐姐',
    7: '姐夫', 8: '弟弟', 9: '弟媳', 10: '妹妹', 11: '妹夫', 12: '大伯哥',
    13: '小叔子', 14: '大姑姐', 15: '小姑子', 16: '大舅哥', 17: '小舅子', 18: '大姨子',
    19: '小姨子', 20: '连襟', 21: '妯娌', 22: '岳父', 23: '岳母', 24: '女婿',
    25: '公公', 26: '婆婆', 27: '儿媳妇', 28: '父亲', 29: '母亲', 30: '儿子',
    31: '女儿', 32: '伯父', 33: '叔叔', 34: '姑姑', 35: '侄子', 36: '侄女',
    37: '舅舅', 38: '姨妈', 39: '外甥', 40: '外甥女', 41: '爷爷', 42: '奶奶',
    43: '孙子', 44: '孙女', 45: '姥爷', 46: '姥姥', 47: '外孙', 48: '外孙女',
  },
  // 对应关系 举例: 男方/女方
  cust_relation_opposite: {
    1: '1', 2: '2', 3: '3', 4: '8/10', 5: '13/15', 6: '8/10', 7: '17/19', 8: '4/6',
    9: '12/14', 10: '3/6', 11: '16/19', 12: '9', 13: '5', 14: '9', 15: '5', 16: '7',
    17: '7', 18: '11', 19: '7', 20: '20', 21: '21', 22: '24', 23: '24', 24: '22/23',
    25: '27', 26: '27', 27: '25/26', 28: '30/31', 29: '30/31', 30: '28/29',
    31: '28/29', 32: '35/36', 33: '35/36', 34: '35/36', 35: '32|33/34',
    36: '32|33/34', 37: '39/40', 38: '39/40', 39: '37/38', 40: '37/38',
    41: '43/44', 42: '43/44', 43: '41/42', 44: '41/42', 45: '47/48',
    46: '47/48', 47: '45/46', 48: '45/46',
  },

  // 维修保养类型
  maintain_type: {
    1: '首次保养',
    2: '定期保养',
    3: '专项保养',
  },

  // 投诉类型
  complaint_type: {
    1: '服务态度',
    2: '服务质量',
    3: '产品质量',
    4: '费用价格',
    5: '不守时',
    6: '维修技术',
  },

  // 客户服务互动类型
  interact_type: {
    1: '其它',
    100: '新车销售',
    200: '二手车销售',
    201: '二手车收购',
    202: '二手车置换',
    300: '维修保养',
    301: '事故车维修',
    400: '客户投诉',
  },

};
